tangyangguang/Esp32_Irrigation/src/web/IrrigationWeb.cpp
void writeStatusJson(const Irrigation::ZoneStatus& status) {
    Esp32BaseWeb::sendChunk("{\"zoneId\":");
    writeUInt(status.zoneId);
    Esp32BaseWeb::sendChunk(",\"state\":\"");
    Esp32BaseWeb::writeJsonEscaped(Irrigation::zoneStateName(status.state));
    Esp32BaseWeb::sendChunk("\",\"enabled\":");
    writeBool(status.enabled);
    Esp32BaseWeb::sendChunk(",\"busy\":");
    writeBool(status.busy);
    Esp32BaseWeb::sendChunk(",\"errorActive\":");
    writeBool(status.errorActive);
    Esp32BaseWeb::sendChunk(",\"targetSec\":");
    writeUInt(status.targetSec);
    Esp32BaseWeb::sendChunk(",\"elapsedSec\":");
    writeUInt(status.elapsedSec);
    Esp32BaseWeb::sendChunk(",\"remainingSec\":");
    writeUInt(status.remainingSec);
    Esp32BaseWeb::sendChunk(",\"pulses\":");
    writeUInt(status.pulses);
    Esp32BaseWeb::sendChunk(",\"estimatedMl\":");
    writeUInt(status.estimatedMilliliters);
    Esp32BaseWeb::sendChunk(",\"flowRatePerMinuteX1000\":");
    writeUInt(status.flowRatePerMinuteX1000);
    Esp32BaseWeb::sendChunk(",\"planId\":");
    writeUInt(status.planId);
    Esp32BaseWeb::sendChunk("}");
}

void writePlanJson(const Irrigation::PlanDefinition& plan) {
    Esp32BaseWeb::sendChunk("{\"exists\":");
    writeBool(plan.exists);
    Esp32BaseWeb::sendChunk(",\"planId\":");
    writeUInt(plan.planId);
    Esp32BaseWeb::sendChunk(",\"zoneId\":");
    writeUInt(plan.zoneId);
    Esp32BaseWeb::sendChunk(",\"slotIndex\":");
    writeUInt(plan.slotIndex);
    Esp32BaseWeb::sendChunk(",\"name\":\"");
    Esp32BaseWeb::writeJsonEscaped(plan.name);
    Esp32BaseWeb::sendChunk("\",\"enabled\":");
    writeBool(plan.enabled);
    Esp32BaseWeb::sendChunk(",\"time\":\"");
    writeTime(plan.timeHour, plan.timeMinute);
    Esp32BaseWeb::sendChunk("\",\"durationSec\":");
    writeUInt(plan.durationSec);
    Esp32BaseWeb::sendChunk(",\"cycleDays\":");
    writeUInt(plan.cycleDays);
    Esp32BaseWeb::sendChunk(",\"cycleMask\":");
    writeUInt(plan.cycleMask);
    Esp32BaseWeb::sendChunk(",\"cycleStartYmd\":");
    writeUInt(plan.cycleStartYmd);
    Esp32BaseWeb::sendChunk("}");
}

void writeOnePostHidden(const char* name, const char* value) {
    Esp32BaseWeb::sendChunk("<input type='hidden' name='");
    Esp32BaseWeb::writeHtmlEscaped(name);
    Esp32BaseWeb::sendChunk("' value='");
    Esp32BaseWeb::writeHtmlEscaped(value);
    Esp32BaseWeb::sendChunk("'>");
}

void writeHiddenU32(const char* name, uint32_t value) {
    char text[16];
    snprintf(text, sizeof(text), "%lu", static_cast<unsigned long>(value));
    writeOnePostHidden(name, text);
}

void pageHeader(const char* title) {
    Esp32BaseWeb::sendHeader(title);
}

void pageFooter() {
    Esp32BaseWeb::sendFooter();
}

uint32_t durationMinutesForUi(uint32_t seconds) {
    return seconds == 0 ? 0 : ((seconds + 59UL) / 60UL);
}

void writeDurationMinutes(uint32_t seconds) {
    writeUInt(durationMinutesForUi(seconds));
    Esp32BaseWeb::sendChunk(" 分钟");
}

void writeCycleSummary(const Irrigation::PlanDefinition& plan) {
    writeUInt(plan.cycleDays);
    Esp32BaseWeb::sendChunk(" 天循环：");
    bool first = true;
    for (uint8_t i = 0; i < plan.cycleDays; ++i) {
        if ((plan.cycleMask & (1UL << i)) == 0) {
            continue;
        }
        if (!first) {
            Esp32BaseWeb::sendChunk("、");
        }
        first = false;
        Esp32BaseWeb::sendChunk("第 ");
        writeUInt(i + 1);
        Esp32BaseWeb::sendChunk(" 天");
    }
}

void formatDurationHuman(uint32_t seconds, char* out, size_t len) {
    if (!out || len == 0) {
        return;
    }
    const uint32_t hours = seconds / 3600UL;
    const uint32_t minutes = (seconds % 3600UL) / 60UL;
    const uint32_t secs = seconds % 60UL;
    size_t used = 0;
    out[0] = '\0';
    if (hours > 0) {
        used += snprintf(out + used, len - used, "%lu 小时", static_cast<unsigned long>(hours));
    }
    if (used < len && (minutes > 0 || (used == 0 && secs == 0))) {
        used += snprintf(out + used, len - used, "%s%lu 分钟", used > 0 ? " " : "", static_cast<unsigned long>(minutes));
    }
    if (used < len && (secs > 0 || used == 0)) {
        (void)snprintf(out + used, len - used, "%s%lu 秒", used > 0 ? " " : "", static_cast<unsigned long>(secs));
    }
}

void writeDurationHuman(uint32_t seconds) {
    char text[32];
    formatDurationHuman(seconds, text, sizeof(text));
    Esp32BaseWeb::sendChunk(text);
}

void writeDurationMsHuman(uint32_t ms) {
    writeDurationHuman((ms + 999UL) / 1000UL);
}

void writeDateTimeHuman(uint32_t epoch) {
    if (epoch == 0) {
        Esp32BaseWeb::sendChunk("时间未同步");
        return;
    }
    const time_t value = static_cast<time_t>(epoch);
    tm local = {};
    if (localtime_r(&value, &local) == nullptr) {
        Esp32BaseWeb::sendChunk("时间无效");
        return;
    }
    char text[24];
    snprintf(text, sizeof(text), "%04d-%02d-%02d %02d:%02d:%02d",
             local.tm_year + 1900,
             local.tm_mon + 1,
             local.tm_mday,
             local.tm_hour,
             local.tm_min,
             local.tm_sec);
    Esp32BaseWeb::sendChunk(text);
}

const char* zoneStateLabel(Irrigation::ZoneState state) {
    switch (state) {
        case Irrigation::ZoneState::DISABLED: return "已禁用";
        case Irrigation::ZoneState::IDLE: return "待机";
        case Irrigation::ZoneState::STARTING: return "启动中";
        case Irrigation::ZoneState::RUNNING: return "浇水中";
        case Irrigation::ZoneState::ERROR: return "异常";
        default: return "未知";
    }
}

const char* taskTypeLabel(Irrigation::TaskType type) {
    switch (type) {
        case Irrigation::TaskType::PLAN: return "计划浇水";
        case Irrigation::TaskType::MANUAL:
        default: return "手动浇水";
    }
}

const char* taskResultLabel(Irrigation::TaskResult result) {
    switch (result) {
        case Irrigation::TaskResult::COMPLETED: return "正常完成";
        case Irrigation::TaskResult::USER_STOPPED: return "手动停止";
        case Irrigation::TaskResult::FLOW_START_TIMEOUT: return "启动后未检测到水流";
        case Irrigation::TaskResult::FLOW_NO_PULSE_TIMEOUT: return "浇水中断流";
        case Irrigation::TaskResult::LEAK_PROTECTED: return "漏水保护停止";
        case Irrigation::TaskResult::FACTORY_RESET_PROTECTED: return "恢复出厂保护停止";
        case Irrigation::TaskResult::CONFIG_INVALID: return "配置无效";
        case Irrigation::TaskResult::REJECTED: return "启动被拒绝";
        case Irrigation::TaskResult::NONE:
        default: return "未完成";
    }
}

const char* eventTypeLabel(Irrigation::EventType type) {
    switch (type) {
        case Irrigation::EventType::BOOT: return "系统启动";
        case Irrigation::EventType::ZONE_CONFIG_CHANGED: return "水路配置变更";
        case Irrigation::EventType::SYSTEM_CONFIG_CHANGED: return "系统配置变更";
        case Irrigation::EventType::PLAN_CHANGED: return "计划变更";
        case Irrigation::EventType::PLAN_OBSERVED: return "计划调度";
        case Irrigation::EventType::WATER_START: return "开始浇水";
        case Irrigation::EventType::WATER_FINISH: return "浇水完成";
        case Irrigation::EventType::WATER_ERROR: return "浇水异常";
        case Irrigation::EventType::LEAK_ALERT: return "漏水告警";
        case Irrigation::EventType::ALERT_CLEARED: return "告警清除";
        case Irrigation::EventType::FACTORY_RESET_REQUESTED: return "请求恢复出厂";
        case Irrigation::EventType::FACTORY_RESET_EXECUTED: return "已恢复出厂";
        case Irrigation::EventType::WIFI_STATUS_CHANGED: return "网络状态";
        case Irrigation::EventType::OTA_STATUS_CHANGED: return "固件升级";
        default: return "未知事件";
    }
}

const char* eventSourceLabel(Irrigation::EventSource source) {
    switch (source) {
        case Irrigation::EventSource::BUTTON: return "本地按键";
        case Irrigation::EventSource::WEB: return "网页";
        case Irrigation::EventSource::PLAN: return "计划";
        case Irrigation::EventSource::SYSTEM:
        default: return "系统";
    }
}

