tangyangguang/Esp32_Irrigation/src/web/IrrigationWeb.cpp
const char* observationStatusLabel(Irrigation::PlanObservationStatus status) {
    switch (status) {
        case Irrigation::PlanObservationStatus::STARTED: return "计划已启动";
        case Irrigation::PlanObservationStatus::SKIPPED_CALENDAR: return "当天已设置跳过";
        case Irrigation::PlanObservationStatus::SKIPPED_DISABLED: return "计划或水路已停用";
        case Irrigation::PlanObservationStatus::SKIPPED_BUSY: return "水路正在执行其他任务";
        case Irrigation::PlanObservationStatus::SKIPPED_ERROR: return "水路处于异常状态";
        case Irrigation::PlanObservationStatus::SKIPPED_LEAK: return "因漏水告警跳过";
        case Irrigation::PlanObservationStatus::SKIPPED_RESET: return "恢复出厂中跳过";
        case Irrigation::PlanObservationStatus::SKIPPED_CYCLE: return "非本轮执行日";
        case Irrigation::PlanObservationStatus::SKIPPED_CONFIG_INVALID: return "配置无效，未执行";
        case Irrigation::PlanObservationStatus::REJECTED: return "启动被拒绝";
        case Irrigation::PlanObservationStatus::MISSED: return "系统发现计划已错过";
        case Irrigation::PlanObservationStatus::NOT_EVALUATED:
        default: return "未评估";
    }
}

void writeEventDetail(const EventStore::Event& event) {
    const Irrigation::EventType type = static_cast<Irrigation::EventType>(event.type);
    switch (type) {
        case Irrigation::EventType::BOOT:
            Esp32BaseWeb::sendChunk("设备启动完成");
            return;
        case Irrigation::EventType::ZONE_CONFIG_CHANGED:
            Esp32BaseWeb::sendChunk("水路配置已保存");
            return;
        case Irrigation::EventType::SYSTEM_CONFIG_CHANGED:
            Esp32BaseWeb::sendChunk("系统配置已保存");
            return;
        case Irrigation::EventType::PLAN_CHANGED:
            Esp32BaseWeb::sendChunk(event.code == 1 ? "计划已创建" : (event.code == 2 ? "计划已删除" : "计划已保存"));
            return;
        case Irrigation::EventType::PLAN_OBSERVED:
            Esp32BaseWeb::writeHtmlEscaped(observationStatusLabel(static_cast<Irrigation::PlanObservationStatus>(event.code)));
            return;
        case Irrigation::EventType::WATER_START:
            Esp32BaseWeb::sendChunk("目标时长 ");
            writeDurationHuman(static_cast<uint32_t>(event.value1 > 0 ? event.value1 : 0));
            return;
        case Irrigation::EventType::WATER_FINISH:
        case Irrigation::EventType::WATER_ERROR:
            Esp32BaseWeb::writeHtmlEscaped(taskResultLabel(static_cast<Irrigation::TaskResult>(event.code)));
            return;
        case Irrigation::EventType::LEAK_ALERT:
            Esp32BaseWeb::sendChunk("待机状态检测到异常流量");
            return;
        case Irrigation::EventType::ALERT_CLEARED:
            Esp32BaseWeb::sendChunk(event.zoneId == 0 ? "全部告警已清除" : "水路告警已清除");
            return;
        case Irrigation::EventType::WIFI_STATUS_CHANGED:
            if (strcmp(event.text, "CONNECTED") == 0) {
                Esp32BaseWeb::sendChunk("网络已连接");
            } else if (strcmp(event.text, "CONNECTING") == 0) {
                Esp32BaseWeb::sendChunk("网络连接中");
            } else {
                Esp32BaseWeb::writeHtmlEscaped(event.text);
            }
            return;
        case Irrigation::EventType::FACTORY_RESET_REQUESTED:
            Esp32BaseWeb::sendChunk("已请求恢复出厂设置");
            return;
        case Irrigation::EventType::FACTORY_RESET_EXECUTED:
            Esp32BaseWeb::sendChunk("恢复出厂设置已执行");
            return;
        case Irrigation::EventType::OTA_STATUS_CHANGED:
            Esp32BaseWeb::writeHtmlEscaped(event.text);
            return;
        default:
            Esp32BaseWeb::writeHtmlEscaped(event.text);
            return;
    }
}

void readPaging(uint16_t total, uint16_t defaultPerPage, uint32_t* page, uint32_t* perPage, uint16_t* offset) {
    uint32_t rawPage = 1;
    uint32_t rawPer = defaultPerPage;
    (void)readU32("page", &rawPage);
    (void)readU32("per", &rawPer);
    if (rawPer != 10 && rawPer != 20 && rawPer != 50) {
        rawPer = defaultPerPage;
    }
    const uint32_t totalPages = total == 0 ? 1 : ((static_cast<uint32_t>(total) + rawPer - 1UL) / rawPer);
    if (rawPage < 1) {
        rawPage = 1;
    } else if (rawPage > totalPages) {
        rawPage = totalPages;
    }
    *page = rawPage;
    *perPage = rawPer;
    *offset = static_cast<uint16_t>((rawPage - 1UL) * rawPer);
}

void handleOverviewPage() {
    if (!Esp32BaseWeb::checkAuth()) return;
    pageHeader("灌溉总览");
    Esp32BaseWeb::sendPageTitle("灌溉总览", "固定 4 路 Zone，按水路独立运行。");

    uint8_t enabledCount = 0;
    uint8_t runningCount = 0;
    uint8_t errorCount = 0;
    uint8_t startableCount = 0;
    for (uint8_t zoneId = 1; zoneId <= Irrigation::MaxZones; ++zoneId) {
        const Irrigation::ZoneStatus status = ZoneManager::status(zoneId);
        if (!status.enabled) {
            continue;
        }
        ++enabledCount;
        if (status.busy) {
            ++runningCount;
        }
        if (status.errorActive) {
            ++errorCount;
        }
        if (!status.busy && !status.errorActive && !ZoneManager::leakAlertActive()) {
            ++startableCount;
        }
    }

    char runningText[16];
    char startableText[16];
    char errorText[16];
    char safetyText[24];
    snprintf(runningText, sizeof(runningText), "%u / %u", static_cast<unsigned>(runningCount), static_cast<unsigned>(enabledCount));
    snprintf(startableText, sizeof(startableText), "%u", static_cast<unsigned>(startableCount));
    snprintf(errorText, sizeof(errorText), "%u", static_cast<unsigned>(errorCount));
    if (ZoneManager::leakAlertActive()) {
        strlcpy(safetyText, "漏水告警", sizeof(safetyText));
    } else if (errorCount > 0) {
        snprintf(safetyText, sizeof(safetyText), "%u 路异常", static_cast<unsigned>(errorCount));
    } else {
        strlcpy(safetyText, "正常", sizeof(safetyText));
    }

    Esp32BaseWeb::beginPanel("关键指标");
    Esp32BaseWeb::beginMetricGrid();
    Esp32BaseWeb::sendMetric("系统安全", safetyText, ZoneManager::leakAlertActive() ? "需要现场确认" : "无全局漏水告警");
    Esp32BaseWeb::sendMetric("正在浇水", runningText, "当前执行数 / 有效水路数");
    Esp32BaseWeb::sendMetric("异常水路", errorText, errorCount > 0 ? "可在水路状态中清除" : "无锁定异常");
    Esp32BaseWeb::sendMetric("可手动启动", startableText, "显示在手动浇水启动区");
    Esp32BaseWeb::endMetricGrid();
    Esp32BaseWeb::endPanel();

    Esp32BaseWeb::beginPanel("水路状态");
    Esp32BaseWeb::sendChunk("<div class='tablewrap'><table class='part'><thead><tr><th>水路</th><th>状态</th><th>任务</th><th>目标时长</th><th>剩余时间</th><th>脉冲</th><th>估算水量</th><th>操作</th></tr></thead><tbody>");
    bool wroteStatus = false;
    for (uint8_t zoneId = 1; zoneId <= Irrigation::MaxZones; ++zoneId) {
        const Irrigation::ZoneStatus status = ZoneManager::status(zoneId);
        if (!status.enabled) {
            continue;
        }
        const Irrigation::ZoneConfig& config = ZoneManager::config(zoneId);
        wroteStatus = true;
        Esp32BaseWeb::sendChunk("<tr><td>");
        Esp32BaseWeb::writeHtmlEscaped(config.name);
        Esp32BaseWeb::sendChunk("</td><td><span class='tag");
        Esp32BaseWeb::sendChunk(uiToneForState(status.state));
        Esp32BaseWeb::sendChunk("'>");
        Esp32BaseWeb::writeHtmlEscaped(zoneStateLabel(status.state));
        Esp32BaseWeb::sendChunk("</span></td><td>");
        Esp32BaseWeb::writeHtmlEscaped(status.busy ? taskTypeLabel(status.taskType) : "-");
        Esp32BaseWeb::sendChunk("</td><td>");
        writeDurationHuman(status.targetSec);
        Esp32BaseWeb::sendChunk("</td><td>");
        writeDurationHuman(status.remainingSec);
        Esp32BaseWeb::sendChunk("</td><td>");
        writeUInt(status.pulses);
        Esp32BaseWeb::sendChunk("</td><td>");
        writeUInt(status.estimatedMilliliters);
        Esp32BaseWeb::sendChunk(" ml</td><td><div class='fsactions'>");
        if (status.busy) {
            Esp32BaseWeb::sendChunk("<form method='post' action='/api/v1/zone/stop' onsubmit=\"return confirm('确认停止该水路？')&&once(this)\">");
            writeOnePostHidden("source", "web_page");
            writeHiddenU32("zoneId", zoneId);
            Esp32BaseWeb::sendChunk("<input class='fsaction' type='submit' value='停止'></form>");
        }
        if (status.errorActive) {
            Esp32BaseWeb::sendChunk("<form method='post' action='/api/v1/zone/clear-error' onsubmit=\"return confirm('确认现场已处理并清除异常？')&&once(this)\">");
            writeOnePostHidden("source", "web_page");
            writeHiddenU32("zoneId", zoneId);
            Esp32BaseWeb::sendChunk("<input class='fsaction' type='submit' value='清除异常'></form>");
        }
        if (!status.busy && !status.errorActive) {
            Esp32BaseWeb::sendChunk("-");
        }
        Esp32BaseWeb::sendChunk("</div></td></tr>");
    }
    if (!wroteStatus) {
        Esp32BaseWeb::sendChunk("<tr><td colspan='8'>暂无启用水路</td></tr>");
    }
    Esp32BaseWeb::sendChunk("</tbody></table></div><div class='actions'><form method='post' action='/api/v1/zones/stop-all' onsubmit=\"return confirm('确认停止全部水路？')&&once(this)\">");
    writeOnePostHidden("source", "web_page");
    Esp32BaseWeb::sendChunk("<input class='danger' type='submit' value='全部停止'");
    Esp32BaseWeb::sendChunk(runningCount > 0 ? "" : " disabled");
    Esp32BaseWeb::sendChunk("></form></div>");
    Esp32BaseWeb::endPanel();

    Esp32BaseWeb::beginPanel("手动浇水启动");
    Esp32BaseWeb::sendChunk("<div class='tablewrap'><table class='part'><thead><tr><th>水路</th><th>启动设置</th></tr></thead><tbody>");
    bool wroteManual = false;
    for (uint8_t zoneId = 1; zoneId <= Irrigation::MaxZones; ++zoneId) {
        const Irrigation::ZoneStatus status = ZoneManager::status(zoneId);
        if (!status.enabled || status.busy || status.errorActive || ZoneManager::leakAlertActive()) {
            continue;
        }
        const Irrigation::ZoneConfig& config = ZoneManager::config(zoneId);
        wroteManual = true;
        Esp32BaseWeb::sendChunk("<tr><td>");
        Esp32BaseWeb::writeHtmlEscaped(config.name);
        Esp32BaseWeb::sendChunk("</td><td><div class='fsactions'>");
        Esp32BaseWeb::sendChunk("<form method='post' action='/api/v1/zone/start' onsubmit=\"return confirm('确认手动启动该水路？')&&once(this)\">");
        writeOnePostHidden("source", "web_page");
        writeHiddenU32("zoneId", zoneId);
        Esp32BaseWeb::sendChunk("<input type='number' name='durationMin' min='1' max='");
        writeUInt(SystemConfigStore::current().maxWateringDurationSec / 60UL);
        Esp32BaseWeb::sendChunk("' value='");
        writeUInt(durationMinutesForUi(SystemConfigStore::current().manualDefaultDurationSec));
        Esp32BaseWeb::sendChunk("'><select onchange='this.form.durationMin.value=this.value'>");
        for (uint8_t i = 0; i < 6; ++i) {
            const uint32_t presetMin = durationMinutesForUi(SystemConfigStore::current().durationPresets[i]);
            Esp32BaseWeb::sendChunk("<option value='");
            writeUInt(presetMin);
            Esp32BaseWeb::sendChunk("'>");
            writeUInt(presetMin);
            Esp32BaseWeb::sendChunk(" 分钟</option>");
        }
        Esp32BaseWeb::sendChunk("</select><input class='fsaction' type='submit' value='启动'></form></div><small>可输入 1 到 ");
        writeUInt(SystemConfigStore::current().maxWateringDurationSec / 60UL);
        Esp32BaseWeb::sendChunk(" 分钟，或选择快捷时长。</small></td></tr>");
    }
    if (!wroteManual) {
        Esp32BaseWeb::sendChunk("<tr><td colspan='2'>当前没有可手动启动的水路</td></tr>");
    }
    Esp32BaseWeb::sendChunk("</tbody></table></div>");
    Esp32BaseWeb::endPanel();
    pageFooter();
}

