tangyangguang/Esp32_Irrigation/src/web/IrrigationWeb.cpp
void writePlanRow(const Irrigation::PlanDefinition& plan) {
    Esp32BaseWeb::sendChunk("<tr><td>");
    Esp32BaseWeb::writeHtmlEscaped(plan.name);
    Esp32BaseWeb::sendChunk("</td><td>");
    Esp32BaseWeb::sendChunk(plan.enabled ? "启用" : "停用");
    Esp32BaseWeb::sendChunk("</td><td>");
    writeTime(plan.timeHour, plan.timeMinute);
    Esp32BaseWeb::sendChunk("</td><td>");
    writeDurationMinutes(plan.durationSec);
    Esp32BaseWeb::sendChunk("</td><td>");
    writeCycleSummary(plan);
    Esp32BaseWeb::sendChunk("</td><td><div class='fsactions'><a class='btnlink compact' href='/irrigation/plan?planId=");
    writeUInt(plan.planId);
    Esp32BaseWeb::sendChunk("'>编辑</a><form method='post' action='");
    Esp32BaseWeb::sendChunk(plan.enabled ? "/api/v1/plan/disable" : "/api/v1/plan/enable");
    Esp32BaseWeb::sendChunk("' onsubmit=\"return confirm('确认切换计划状态？')&&once(this)\">");
    writeOnePostHidden("source", "web_page");
    writeHiddenU32("planId", plan.planId);
    Esp32BaseWeb::sendChunk("<input class='fsaction' type='submit' value='");
    Esp32BaseWeb::sendChunk(plan.enabled ? "停用" : "启用");
    Esp32BaseWeb::sendChunk("'></form><form method='post' action='/api/v1/plan/delete' onsubmit=\"return confirm('确认删除该计划？')&&once(this)\">");
    writeOnePostHidden("source", "web_page");
    writeHiddenU32("planId", plan.planId);
    Esp32BaseWeb::sendChunk("<input class='fsdelete danger' type='submit' value='删除'></form></div></td></tr>");
}

void handlePlansPage() {
    if (!Esp32BaseWeb::checkAuth()) return;
    pageHeader("计划");
    Esp32BaseWeb::sendPageTitle("计划", "每个 Zone 最多 6 条计划。");
    bool wroteZone = false;
    for (uint8_t zoneId = 1; zoneId <= Irrigation::MaxZones; ++zoneId) {
        const Irrigation::ZoneConfig& zone = ZoneManager::config(zoneId);
        if (!zone.enabled) {
            continue;
        }
        wroteZone = true;
        Esp32BaseWeb::beginPanel(zone.name);
        Esp32BaseWeb::sendChunk("<div class='actions'>");
        if (PlanStore::countForZone(zoneId) < Irrigation::MaxPlansPerZone) {
            Esp32BaseWeb::sendChunk("<a class='btnlink compact' href='/irrigation/plan?zoneId=");
            writeUInt(zoneId);
            Esp32BaseWeb::sendChunk("'>新增计划</a>");
        } else {
            Esp32BaseWeb::sendChunk("<span class='tag'>计划已满</span>");
        }
        Esp32BaseWeb::sendChunk("</div><div class='tablewrap'><table class='part'><thead><tr><th>名称</th><th>状态</th><th>时间</th><th>时长</th><th>循环</th><th>操作</th></tr></thead><tbody>");
        bool wrote = false;
        for (uint8_t slot = 0; slot < Irrigation::MaxPlansPerZone; ++slot) {
            const Irrigation::PlanDefinition& plan = PlanStore::getBySlot(zoneId, slot);
            if (plan.exists) {
                writePlanRow(plan);
                wrote = true;
            }
        }
        if (!wrote) {
            Esp32BaseWeb::sendChunk("<tr><td colspan='6'>暂无计划</td></tr>");
        }
        Esp32BaseWeb::sendChunk("</tbody></table></div>");
        Esp32BaseWeb::endPanel();
    }
    if (!wroteZone) {
        Esp32BaseWeb::beginPanel("计划");
        Esp32BaseWeb::sendChunk("<p class='muted'>暂无启用水路。请先到水路管理中启用需要使用的水路。</p>");
        Esp32BaseWeb::endPanel();
    }
    pageFooter();
}

Irrigation::PlanDefinition makeDraftPlan(uint8_t zoneId) {
    Irrigation::PlanDefinition plan = {};
    plan.exists = true;
    plan.zoneId = zoneId;
    strlcpy(plan.name, "新计划", sizeof(plan.name));
    plan.enabled = false;
    plan.timeHour = 7;
    plan.timeMinute = 0;
    plan.durationSec = SystemConfigStore::current().manualDefaultDurationSec;
    plan.cycleDays = 1;
    plan.cycleMask = 1;
    plan.cycleStartYmd = currentYmd();
    return plan;
}

bool applyPlanForm(Irrigation::PlanDefinition& plan, const char** error) {
    uint32_t value = 0;
    if (Esp32BaseWeb::hasParam("name") && !Esp32BaseWeb::getParam("name", plan.name, sizeof(plan.name))) {
        *error = "invalid_name";
        return false;
    }
    if (Esp32BaseWeb::hasParam("enabledPresent")) {
        plan.enabled = readCheckbox("enabled");
    } else if (Esp32BaseWeb::hasParam("enabled") && !readBool("enabled", &plan.enabled)) {
        *error = "invalid_enabled";
        return false;
    }
    if (Esp32BaseWeb::hasParam("time") && !readTimeParam("time", &plan.timeHour, &plan.timeMinute)) {
        *error = "invalid_time";
        return false;
    }
    if (Esp32BaseWeb::hasParam("durationMin")) {
        if (!readU32("durationMin", &value) || value == 0 || value > (SystemConfigStore::current().maxWateringDurationSec / 60UL)) {
            *error = "invalid_duration";
            return false;
        }
        plan.durationSec = value * 60UL;
    } else if (Esp32BaseWeb::hasParam("durationSec") && !readU32("durationSec", &plan.durationSec)) {
        *error = "invalid_duration";
        return false;
    }
    if (Esp32BaseWeb::hasParam("cycleDays") && !readU8("cycleDays", &plan.cycleDays)) {
        *error = "invalid_cycle_days";
        return false;
    }
    if (Esp32BaseWeb::hasParam("cycleMask") && !readU32("cycleMask", &plan.cycleMask)) {
        *error = "invalid_cycle_mask";
        return false;
    }
    if (Esp32BaseWeb::hasParam("cycleStartYmd") && !readYmd("cycleStartYmd", &plan.cycleStartYmd)) {
        *error = "invalid_cycle_start";
        return false;
    }
    if (plan.durationSec > SystemConfigStore::current().maxWateringDurationSec) {
        *error = "duration_exceeds_system_limit";
        return false;
    }
    return true;
}

void writePlanForm(const Irrigation::PlanDefinition& plan, bool creating) {
    Esp32BaseWeb::sendChunk("<form class='editform planform' method='post' action='");
    Esp32BaseWeb::sendChunk(creating ? "/api/v1/plan/create" : "/api/v1/plan/update");
    Esp32BaseWeb::sendChunk("' onsubmit=\"return irrPlanPrepare(this)&&confirm('确认保存计划？')&&once(this)\">");
    writeOnePostHidden("source", "web_page");
    if (creating) {
        writeHiddenU32("zoneId", plan.zoneId);
    } else {
        writeHiddenU32("planId", plan.planId);
    }
    Esp32BaseWeb::sendChunk("<input type='hidden' name='cycleMask' value='");
    writeUInt(plan.cycleMask);
    Esp32BaseWeb::sendChunk("'><input type='hidden' name='durationSec' value='");
    writeUInt(plan.durationSec);
    Esp32BaseWeb::sendChunk("'><input type='hidden' name='enabledPresent' value='1'><div class='fieldgrid'>"
                            "<p class='field med'><label>名称</label><input name='name' maxlength='31' value='");
    Esp32BaseWeb::writeHtmlEscaped(plan.name);
    Esp32BaseWeb::sendChunk("'><small>用于在计划列表和浇水记录中识别这条计划。</small></p><p class='field short'><label><input type='checkbox' name='enabled' value='1'");
    Esp32BaseWeb::sendChunk(plan.enabled ? " checked" : "");
    Esp32BaseWeb::sendChunk("> 启用计划</label><small>勾选后计划才会按时间自动执行。</small></p><p class='field short'><label>开始时间</label><input name='time' type='time' value='");
    writeTime(plan.timeHour, plan.timeMinute);
    Esp32BaseWeb::sendChunk("'><small>每天到达该时间时检查是否需要执行。</small></p><p class='field short'><label>浇水时长（分钟）</label><input name='durationMin' type='number' min='1' max='");
    writeUInt(SystemConfigStore::current().maxWateringDurationSec / 60UL);
    Esp32BaseWeb::sendChunk("' value='");
    writeUInt(durationMinutesForUi(plan.durationSec));
    Esp32BaseWeb::sendChunk("'><small>单次浇水时长，受系统单次上限约束。</small></p><p class='field short'><label>循环天数</label><input name='cycleDays' type='number' min='1' max='30' value='");
    writeUInt(plan.cycleDays);
    Esp32BaseWeb::sendChunk("' oninput='irrPlanCycle(this.form)'><small>例如 3 天循环会显示第 1、2、3 天可选。</small></p><p class='field short'><label>起始日期</label><input name='cycleStartYmd' type='date' value='");
    writeYmdInput(plan.cycleStartYmd);
    Esp32BaseWeb::sendChunk("'><small>用于计算当前处于循环中的第几天。</small></p><div class='field full'><label>执行日</label><div class='radioopts'>");
    for (uint8_t i = 0; i < 30; ++i) {
        Esp32BaseWeb::sendChunk("<label data-cycle-day='");
        writeUInt(i);
        Esp32BaseWeb::sendChunk("'");
        if (i >= plan.cycleDays) {
            Esp32BaseWeb::sendChunk(" hidden");
        }
        Esp32BaseWeb::sendChunk("><input type='checkbox'");
        if ((plan.cycleMask & (1UL << i)) != 0) {
            Esp32BaseWeb::sendChunk(" checked");
        }
        Esp32BaseWeb::sendChunk(">第 ");
        writeUInt(i + 1);
        Esp32BaseWeb::sendChunk(" 天</label>");
    }
    Esp32BaseWeb::sendChunk("</div><small>勾选循环周期中需要浇水的日期。</small></div></div><div class='actions'><input type='submit' value='保存'><a class='btnlink secondary' href='/irrigation/plans'>返回</a></div></form>"
                            "<script>"
                            "function irrPlanCycle(f){var n=parseInt(f.cycleDays.value||'0',10),ds=f.querySelectorAll('[data-cycle-day]');for(var i=0;i<ds.length;i++){ds[i].hidden=i>=n;}}"
                            "function irrPlanPrepare(f){var m=parseInt(f.durationMin.value||'0',10),n=parseInt(f.cycleDays.value||'0',10),mask=0,ds=f.querySelectorAll('[data-cycle-day]');if(!m||m<1){alert('浇水时长无效');return false;}f.durationSec.value=String(m*60);if(!n||n<1||n>30){alert('循环天数无效');return false;}for(var i=0;i<n&&i<ds.length;i++){if(ds[i].querySelector('input').checked)mask|=(1<<i);}if(!mask){alert('至少选择一个执行日');return false;}f.cycleMask.value=String(mask);return true;}"
                            "irrPlanCycle(document.currentScript.previousElementSibling);"
                            "</script>");
}

void handlePlanEditPage() {
    if (!Esp32BaseWeb::checkAuth()) return;
    uint32_t planId = 0;
    uint8_t zoneId = 0;
    Irrigation::PlanDefinition plan = {};
    const bool editing = Esp32BaseWeb::hasParam("planId");
    if (editing && (!readU32("planId", &planId) || !PlanStore::getById(planId, &plan))) {
        pageHeader("计划编辑");
        Esp32BaseWeb::sendNotice(Esp32BaseWeb::UI_WARN, "计划不存在", "请返回计划页重新选择。");
        pageFooter();
        return;
    }
    if (!editing) {
        if (!readZoneId(&zoneId)) {
            pageHeader("新增计划");
            Esp32BaseWeb::sendNotice(Esp32BaseWeb::UI_WARN, "水路不存在", "请返回计划页重新选择。");
            pageFooter();
            return;
        }
        plan = makeDraftPlan(zoneId);
    }
    pageHeader(editing ? "计划编辑" : "新增计划");
    Esp32BaseWeb::beginPanel(editing ? plan.name : ZoneManager::config(zoneId).name);
    writePlanForm(plan, !editing);
    Esp32BaseWeb::endPanel();
    pageFooter();
}

void handleSettingsPage() {
    if (!Esp32BaseWeb::checkAuth()) return;
    uint8_t editZoneId = 0;
    if (Esp32BaseWeb::hasParam("zoneId")) {
        if (!readZoneId(&editZoneId)) {
            pageHeader("水路管理");
            Esp32BaseWeb::sendNotice(Esp32BaseWeb::UI_WARN, "水路不存在", "请返回水路管理页重新选择。");
            pageFooter();
            return;
        }
        const Irrigation::ZoneConfig& zone = ZoneManager::config(editZoneId);
        pageHeader("水路编辑");
        Esp32BaseWeb::sendPageTitle("水路编辑", "修改单个水路的名称、启用状态、流量校准和错误策略。");
        Esp32BaseWeb::beginPanel(zone.name);
        Esp32BaseWeb::sendChunk("<form class='editform' method='post' action='/api/v1/zone/config' onsubmit=\"return confirm('确认保存水路配置？')&&once(this)\">");
        writeOnePostHidden("source", "web_page");
        writeHiddenU32("zoneId", editZoneId);
        Esp32BaseWeb::sendChunk("<input type='hidden' name='enabledPresent' value='1'><input type='hidden' name='suppressErrorPresent' value='1'><div class='fieldgrid'><p class='field med'><label>名称</label><input name='name' maxlength='31' value='");
        Esp32BaseWeb::writeHtmlEscaped(zone.name);
        Esp32BaseWeb::sendChunk("'><small>显示在首页、计划和记录中的水路名称。</small></p><p class='field med'><label><input type='checkbox' name='enabled' value='1'");
        Esp32BaseWeb::sendChunk(zone.enabled ? " checked" : "");
        Esp32BaseWeb::sendChunk("> 启用水路</label><small>未启用的水路不会出现在首页和计划业务页面，也不能启动浇水。</small></p><p class='field short'><label>每升脉冲</label><input name='pulsePerLiter' type='number' min='1' max='10000' value='");
        writeUInt(zone.pulsePerLiter);
        Esp32BaseWeb::sendChunk("'><small>流量计每通过 1 升水产生的脉冲数，用于估算水量。</small></p><p class='field short'><label>校准 x1000</label><input name='calibrationX1000' type='number' min='100' max='10000' value='");
        writeUInt(zone.calibrationX1000);
        Esp32BaseWeb::sendChunk("'><small>水量估算修正系数，1000 表示不修正。</small></p><p class='field short'><label>启动超时秒</label><input name='startTimeoutSec' type='number' min='1' max='300' value='");
        writeUInt(zone.startTimeoutSec);
        Esp32BaseWeb::sendChunk("'><small>开阀后在该时间内没有检测到水流，判定启动异常。</small></p><p class='field short'><label>无脉冲超时秒</label><input name='flowNoPulseTimeoutSec' type='number' min='1' max='300' value='");
        writeUInt(zone.flowNoPulseTimeoutSec);
        Esp32BaseWeb::sendChunk("'><small>运行中超过该时间没有新脉冲，判定断流异常。</small></p><p class='field full'><label><input type='checkbox' name='suppressError' value='1'");
        Esp32BaseWeb::sendChunk(zone.suppressError ? " checked" : "");
        Esp32BaseWeb::sendChunk("> 流量异常只记录，不锁定水路</label><small>勾选后，启动无水流或运行中断流只写入记录，不把水路锁定为异常；未勾选时会锁定异常，需要人工清除。</small></p></div><div class='actions'><input type='submit' value='保存水路配置'><a class='btnlink secondary' href='/irrigation/zones'>返回列表</a></div></form>");
        Esp32BaseWeb::endPanel();
        pageFooter();
        return;
    }

    pageHeader("水路管理");
    Esp32BaseWeb::sendPageTitle("水路管理", "查看 4 路水路状态；点击编辑进入单个水路配置。系统级参数在基础库 App Config 中设置。");
    Esp32BaseWeb::beginPanel("水路列表");
    Esp32BaseWeb::sendChunk("<div class='tablewrap'><table class='part'><thead><tr><th>水路</th><th>启用状态</th><th>阀门 GPIO</th><th>流量 GPIO</th><th>每升脉冲</th><th>校准</th><th>错误策略</th><th>操作</th></tr></thead><tbody>");
    for (uint8_t zoneId = 1; zoneId <= Irrigation::MaxZones; ++zoneId) {
        const Irrigation::ZoneConfig& zone = ZoneManager::config(zoneId);
        Esp32BaseWeb::sendChunk("<tr><td>");
        Esp32BaseWeb::writeHtmlEscaped(zone.name);
        Esp32BaseWeb::sendChunk("</td><td><span class='tag");
        Esp32BaseWeb::sendChunk(zone.enabled ? " ok" : "");
        Esp32BaseWeb::sendChunk("'>");
        Esp32BaseWeb::sendChunk(zone.enabled ? "启用" : "停用");
        Esp32BaseWeb::sendChunk("</span></td><td>");
        writeUInt(zone.valvePin);
        Esp32BaseWeb::sendChunk("</td><td>");
        writeUInt(zone.flowPin);
        Esp32BaseWeb::sendChunk("</td><td>");
        writeUInt(zone.pulsePerLiter);
        Esp32BaseWeb::sendChunk("</td><td>");
        writeUInt(zone.calibrationX1000);
        Esp32BaseWeb::sendChunk(" / 1000</td><td>");
        Esp32BaseWeb::sendChunk(zone.suppressError ? "只记录，不锁定异常" : "检测异常并锁定水路");
        Esp32BaseWeb::sendChunk("</td><td><a class='btnlink compact' href='/irrigation/zones?zoneId=");
        writeUInt(zoneId);
        Esp32BaseWeb::sendChunk("'>编辑</a></td></tr>");
    }
    Esp32BaseWeb::sendChunk("</tbody></table></div>");
    Esp32BaseWeb::endPanel();
    pageFooter();
}

struct RecordJsonContext {
    bool first;
};

void writeRecordJson(const RecordStore::WateringRecord& record, void* user) {
    RecordJsonContext* ctx = static_cast<RecordJsonContext*>(user);
    if (!ctx->first) Esp32BaseWeb::sendChunk(",");
    ctx->first = false;
    Esp32BaseWeb::sendChunk("{\"recordId\":");
    writeUInt(record.recordId);
    Esp32BaseWeb::sendChunk(",\"zoneId\":");
    writeUInt(record.zoneId);
    Esp32BaseWeb::sendChunk(",\"taskType\":\"");
    Esp32BaseWeb::writeJsonEscaped(Irrigation::taskTypeName(static_cast<Irrigation::TaskType>(record.taskType)));
    Esp32BaseWeb::sendChunk("\",\"result\":\"");
    Esp32BaseWeb::writeJsonEscaped(Irrigation::taskResultName(static_cast<Irrigation::TaskResult>(record.result)));
    Esp32BaseWeb::sendChunk("\",\"planId\":");
    writeUInt(record.planId);
    Esp32BaseWeb::sendChunk(",\"planName\":\"");
    Esp32BaseWeb::writeJsonEscaped(record.planNameSnapshot);
    Esp32BaseWeb::sendChunk("\",\"targetSec\":");
    writeUInt(record.targetSec);
    Esp32BaseWeb::sendChunk(",\"startedEpoch\":");
    writeUInt(record.startedEpoch);
    Esp32BaseWeb::sendChunk(",\"endedEpoch\":");
    writeUInt(record.endedEpoch);
    Esp32BaseWeb::sendChunk(",\"estimatedMl\":");
    writeUInt(record.estimatedMilliliters);
    Esp32BaseWeb::sendChunk("}");
}

struct EventJsonContext {
    bool first;
};

void writeEventJson(const EventStore::Event& event, void* user) {
    EventJsonContext* ctx = static_cast<EventJsonContext*>(user);
    if (!ctx->first) Esp32BaseWeb::sendChunk(",");
    ctx->first = false;
    Esp32BaseWeb::sendChunk("{\"id\":");
    writeUInt(event.id);
    Esp32BaseWeb::sendChunk(",\"uptimeMs\":");
    writeUInt(event.uptimeMs);
    Esp32BaseWeb::sendChunk(",\"epoch\":");
    writeUInt(event.epoch);
    Esp32BaseWeb::sendChunk(",\"type\":\"");
    Esp32BaseWeb::writeJsonEscaped(EventStore::typeName(static_cast<Irrigation::EventType>(event.type)));
    Esp32BaseWeb::sendChunk("\",\"source\":\"");
    Esp32BaseWeb::writeJsonEscaped(EventStore::sourceName(static_cast<Irrigation::EventSource>(event.source)));
    Esp32BaseWeb::sendChunk("\",\"zoneId\":");
    writeUInt(event.zoneId);
    Esp32BaseWeb::sendChunk(",\"code\":");
    writeUInt(event.code);
    Esp32BaseWeb::sendChunk(",\"text\":\"");
    Esp32BaseWeb::writeJsonEscaped(event.text);
    Esp32BaseWeb::sendChunk("\"}");
}

struct RecordTableContext {
    bool wrote;
};

