tangyangguang/Esp32_Irrigation/src/web/IrrigationWeb.cpp
void writeRecordRow(const RecordStore::WateringRecord& record, void* user) {
    RecordTableContext* ctx = static_cast<RecordTableContext*>(user);
    ctx->wrote = true;
    Esp32BaseWeb::sendChunk("<tr><td>");
    writeUInt(record.recordId);
    Esp32BaseWeb::sendChunk("</td><td>");
    if (Irrigation::validZoneId(record.zoneId)) {
        Esp32BaseWeb::writeHtmlEscaped(ZoneManager::config(record.zoneId).name);
    } else {
        Esp32BaseWeb::sendChunk("-");
    }
    Esp32BaseWeb::sendChunk("</td><td>");
    Esp32BaseWeb::writeHtmlEscaped(taskTypeLabel(static_cast<Irrigation::TaskType>(record.taskType)));
    Esp32BaseWeb::sendChunk("</td><td>");
    Esp32BaseWeb::writeHtmlEscaped(taskResultLabel(static_cast<Irrigation::TaskResult>(record.result)));
    Esp32BaseWeb::sendChunk("</td><td>");
    if (record.planId == Irrigation::NoPlanId) {
        Esp32BaseWeb::sendChunk("-");
    } else {
        writeUInt(record.planId);
        Esp32BaseWeb::sendChunk(" ");
        Esp32BaseWeb::writeHtmlEscaped(record.planNameSnapshot);
    }
    Esp32BaseWeb::sendChunk("</td><td>");
    writeDurationHuman(record.targetSec);
    Esp32BaseWeb::sendChunk("</td><td>");
    writeDateTimeHuman(record.startedEpoch);
    Esp32BaseWeb::sendChunk("</td><td>");
    if (record.endedUptimeMs >= record.startedUptimeMs) {
        writeDurationMsHuman(record.endedUptimeMs - record.startedUptimeMs);
    } else {
        Esp32BaseWeb::sendChunk("-");
    }
    Esp32BaseWeb::sendChunk("</td><td>");
    writeUInt(record.estimatedMilliliters);
    Esp32BaseWeb::sendChunk(" ml</td></tr>");
}

struct EventTableContext {
    bool wrote;
};

void writeEventRow(const EventStore::Event& event, void* user) {
    EventTableContext* ctx = static_cast<EventTableContext*>(user);
    ctx->wrote = true;
    Esp32BaseWeb::sendChunk("<tr><td>");
    writeUInt(event.id);
    Esp32BaseWeb::sendChunk("</td><td>");
    writeDurationMsHuman(event.uptimeMs);
    Esp32BaseWeb::sendChunk("</td><td>");
    writeDateTimeHuman(event.epoch);
    Esp32BaseWeb::sendChunk("</td><td>");
    Esp32BaseWeb::writeHtmlEscaped(eventTypeLabel(static_cast<Irrigation::EventType>(event.type)));
    Esp32BaseWeb::sendChunk("</td><td>");
    Esp32BaseWeb::writeHtmlEscaped(eventSourceLabel(static_cast<Irrigation::EventSource>(event.source)));
    Esp32BaseWeb::sendChunk("</td><td>");
    if (Irrigation::validZoneId(event.zoneId)) {
        Esp32BaseWeb::writeHtmlEscaped(ZoneManager::config(event.zoneId).name);
    } else {
        Esp32BaseWeb::sendChunk("-");
    }
    Esp32BaseWeb::sendChunk("</td><td>");
    writeEventDetail(event);
    Esp32BaseWeb::sendChunk("</td></tr>");
}

void handleRecordsPage() {
    if (!Esp32BaseWeb::checkAuth()) return;
    uint32_t page = 1;
    uint32_t perPage = 20;
    uint16_t offset = 0;
    readPaging(RecordStore::count(), 20, &page, &perPage, &offset);
    pageHeader("浇水记录");
    Esp32BaseWeb::sendPageTitle("浇水记录", "按时间倒序展示浇水执行记录。");
    Esp32BaseWeb::beginPanel("列表");
    Esp32BaseWeb::sendChunk("<div class='tablewrap'><table class='part'><thead><tr><th>ID</th><th>水路</th><th>类型</th><th>结果</th><th>计划</th><th>目标时长</th><th>开始时间</th><th>运行时间</th><th>估算水量</th></tr></thead><tbody>");
    RecordTableContext ctx = {false};
    (void)RecordStore::readLatest(offset, static_cast<uint16_t>(perPage), writeRecordRow, &ctx);
    if (!ctx.wrote) {
        Esp32BaseWeb::sendChunk("<tr><td colspan='9'>暂无记录</td></tr>");
    }
    Esp32BaseWeb::sendChunk("</tbody></table></div>");
    Esp32BaseWeb::sendPagination({"/irrigation/records", nullptr, page, perPage, RecordStore::count()});
    Esp32BaseWeb::endPanel();
    pageFooter();
}

void handleEventsPage() {
    if (!Esp32BaseWeb::checkAuth()) return;
    uint32_t page = 1;
    uint32_t perPage = 20;
    uint16_t offset = 0;
    readPaging(EventStore::count(), 20, &page, &perPage, &offset);
    pageHeader("事件记录");
    Esp32BaseWeb::sendPageTitle("事件记录", "按时间倒序展示系统和业务事件。");
    Esp32BaseWeb::beginPanel("列表");
    Esp32BaseWeb::sendChunk("<div class='tablewrap'><table class='part'><thead><tr><th>ID</th><th>运行时间</th><th>实际时间</th><th>类型</th><th>来源</th><th>水路</th><th>说明</th></tr></thead><tbody>");
    EventTableContext ctx = {false};
    (void)EventStore::readLatest(offset, static_cast<uint16_t>(perPage), writeEventRow, &ctx);
    if (!ctx.wrote) {
        Esp32BaseWeb::sendChunk("<tr><td colspan='7'>暂无事件</td></tr>");
    }
    Esp32BaseWeb::sendChunk("</tbody></table></div>");
    Esp32BaseWeb::sendPagination({"/irrigation/events", nullptr, page, perPage, EventStore::count()});
    Esp32BaseWeb::endPanel();
    pageFooter();
}

void handleStatusApi() {
    if (!Esp32BaseWeb::checkAuth()) return;
    if (!Esp32BaseWeb::isMethod(Esp32BaseWeb::METHOD_GET)) {
        sendMethodNotAllowed("GET");
        return;
    }
    beginJson(200);
    Esp32BaseWeb::sendChunk("{\"ok\":true,\"timeSynced\":");
#if ESP32BASE_ENABLE_NTP
    writeBool(Esp32BaseNtp::isTimeSynced());
#else
    writeBool(false);
#endif
    Esp32BaseWeb::sendChunk(",\"leakAlertActive\":");
    writeBool(ZoneManager::leakAlertActive());
    Esp32BaseWeb::sendChunk(",\"zones\":[");
    for (uint8_t zoneId = 1; zoneId <= Irrigation::MaxZones; ++zoneId) {
        if (zoneId > 1) Esp32BaseWeb::sendChunk(",");
        writeStatusJson(ZoneManager::status(zoneId));
    }
    Esp32BaseWeb::sendChunk("]}");
    endJson();
}

void handleConfigApi() {
    if (!Esp32BaseWeb::checkAuth()) return;
    if (Esp32BaseWeb::isMethod(Esp32BaseWeb::METHOD_GET)) {
        const Irrigation::SystemConfig& system = SystemConfigStore::current();
        beginJson(200);
        Esp32BaseWeb::sendChunk("{\"ok\":true,\"system\":{\"maxWateringDurationSec\":");
        writeUInt(system.maxWateringDurationSec);
        Esp32BaseWeb::sendChunk(",\"scheduleGraceSec\":");
        writeUInt(system.scheduleGraceSec);
        Esp32BaseWeb::sendChunk(",\"manualDefaultDurationSec\":");
        writeUInt(system.manualDefaultDurationSec);
        Esp32BaseWeb::sendChunk(",\"idleLeakWindowSec\":");
        writeUInt(system.idleLeakWindowSec);
        Esp32BaseWeb::sendChunk(",\"idleLeakPulseThreshold\":");
        writeUInt(system.idleLeakPulseThreshold);
        Esp32BaseWeb::sendChunk(",\"durationPresets\":[");
        for (uint8_t i = 0; i < 6; ++i) {
            if (i) Esp32BaseWeb::sendChunk(",");
            writeUInt(system.durationPresets[i]);
        }
        Esp32BaseWeb::sendChunk("]}}");
        endJson();
        return;
    }
    if (!Esp32BaseWeb::isMethod(Esp32BaseWeb::METHOD_POST)) {
        sendMethodNotAllowed("GET,POST");
        return;
    }
    Irrigation::SystemConfig system = SystemConfigStore::current();
    if (Esp32BaseWeb::hasParam("maxWateringDurationSec") && !readU32("maxWateringDurationSec", &system.maxWateringDurationSec)) sendError(400, "invalid_max_duration");
    else if (Esp32BaseWeb::hasParam("scheduleGraceSec") && !readU16("scheduleGraceSec", &system.scheduleGraceSec)) sendError(400, "invalid_schedule_grace");
    else if (Esp32BaseWeb::hasParam("manualDefaultDurationSec") && !readU32("manualDefaultDurationSec", &system.manualDefaultDurationSec)) sendError(400, "invalid_manual_default");
    else if (Esp32BaseWeb::hasParam("idleLeakWindowSec") && !readU16("idleLeakWindowSec", &system.idleLeakWindowSec)) sendError(400, "invalid_leak_window");
    else if (Esp32BaseWeb::hasParam("idleLeakPulseThreshold") && !readU16("idleLeakPulseThreshold", &system.idleLeakPulseThreshold)) sendError(400, "invalid_leak_threshold");
    else {
        bool parsed = true;
        for (uint8_t i = 0; i < 6; ++i) {
            char key[12];
            snprintf(key, sizeof(key), "preset%u", static_cast<unsigned>(i));
            if (Esp32BaseWeb::hasParam(key) && !readU32(key, &system.durationPresets[i])) {
                parsed = false;
            }
        }
        if (!parsed) {
            sendError(400, "invalid_preset");
        } else if (!SystemConfigStore::set(system)) {
            sendError(400, "invalid_system_config");
        } else {
            redirectOrOk("/esp32base/app-config");
        }
    }
}

void handleZoneStartApi() {
    if (!Esp32BaseWeb::checkAuth()) return;
    if (!Esp32BaseWeb::isMethod(Esp32BaseWeb::METHOD_POST)) {
        sendMethodNotAllowed("POST");
        return;
    }
    uint8_t zoneId = 0;
    uint32_t durationSec = 0;
    if (!readZoneId(&zoneId)) {
        sendError(400, "invalid_start_request");
        return;
    }
    if (Esp32BaseWeb::hasParam("durationMin")) {
        uint32_t durationMin = 0;
        if (!readU32("durationMin", &durationMin) || durationMin == 0 || durationMin > (SystemConfigStore::current().maxWateringDurationSec / 60UL)) {
            sendError(400, "invalid_start_duration");
            return;
        }
        durationSec = durationMin * 60UL;
    } else if (!readU32("durationSec", &durationSec)) {
        sendError(400, "invalid_start_request");
        return;
    }
    if (!ZoneManager::startManual(zoneId, durationSec, startSourceFromRequest())) {
        sendError(409, "zone_start_rejected");
        return;
    }
    redirectOrOk();
}

